# CreateSlabStyle

## Description
Creates a new Slab Style of the given name. If the name is already in use, the next available name will be used.

```pascal
FUNCTION CreateSlabStyle(slabStyleName : STRING) : HANDLE;
```

```python

def vs.CreateSlabStyle(slabStyleName):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|slabStyleName|STRING|The name of the new Slab Style.  If the name is already in use, the next available name will be used.|

## Returns
The new Slab Style.

## Version
Availability: from Vectorworks 2011
## Category
* Objects - Architectural